-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2.1
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Май 03 2019 г., 14:49
-- Версия сервера: 5.7.26-0ubuntu0.16.04.1
-- Версия PHP: 7.0.33-0ubuntu0.16.04.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `chater`
--

-- --------------------------------------------------------

--
-- Структура таблицы `history`
--

CREATE TABLE `history` (
  `id` int(11) NOT NULL,
  `userid` int(11) NOT NULL,
  `msg` text CHARACTER SET utf8mb4 NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `history`
--

INSERT INTO `history` (`id`, `userid`, `msg`, `date`) VALUES
(2, 1, 'test', '2019-05-02 14:11:33'),
(3, 1, 'н', '2019-05-02 14:14:05'),
(4, 1, 'привет ', '2019-05-02 14:15:21'),
(5, 1, 'привет! 😂', '2019-05-02 14:23:45'),
(6, 2, 'привет! 😂😂😂', '2019-05-02 14:25:39'),
(7, 1, 'окей 🙆‍♂️ ', '2019-05-02 15:30:56'),
(8, 1, 'найс', '2019-05-02 16:02:52'),
(9, 1, 'тест ', '2019-05-02 16:07:03'),
(10, 2, 'приветули!', '2019-05-02 16:23:13'),
(11, 1, 'примате ', '2019-05-02 16:23:55'),
(12, 1, 'привет ', '2019-05-02 16:24:35'),
(13, 1, 'ку', '2019-05-02 16:25:29'),
(14, 2, 'ура!', '2019-05-02 16:28:38'),
(15, 1, 'ееее', '2019-05-02 16:28:41'),
(16, 2, 'Опа!', '2019-05-02 16:29:25'),
(17, 2, 'URA', '2019-05-02 16:29:40'),
(18, 2, 'Коcтя, привет!', '2019-05-02 16:34:13'),
(19, 1, 'привет 👋 ', '2019-05-02 16:34:23'),
(20, 1, 'ты как?', '2019-05-02 16:34:29'),
(21, 2, 'огонь', '2019-05-02 16:34:35'),
(22, 1, '🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴🔴', '2019-05-02 16:34:54'),
(23, 1, 'привккккееееееееееееееет', '2019-05-02 16:55:04'),
(24, 1, 'длинный текст очень очень очень длинный текст про какого-то кота, пример Симба 🐲☄️✍️☄️☄️✍️🤧✍️✍️✍️', '2019-05-02 17:26:03'),
(25, 3, 'ну давай ещё разочек попробуем, странно очень странно. на сама деле, даже непонятно 🤹‍♂️‼️🤹‍♂️🤹‍♂️‼️‼️🎖‼️‼️', '2019-05-02 17:27:35'),
(26, 1, 'Данила стрел против потиров ', '2019-05-02 17:37:16'),
(27, 1, 'жилмлслсдпддди л л шмлмлиищм', '2019-05-02 17:37:22'),
(28, 1, 'овладела плата. платанов а Алла к а плат а Але. коалу ешьте а хххх', '2019-05-02 17:41:30'),
(29, 2, 'давайте теперь дадим мега тест с диким вообще текстовом, проводила плата 🍁🐲🍁🍭🐲😃☄️😃😃😀👋😀😄🐲🤣👨‍👨‍👧‍👧🧀🐲🍁🐲🍁🍁🧀🏊‍♂️🧀🍭🧀🍭🧀🍭🧀🍭🍭🧀🍭🧀🍭🧀🍭🧀🍭🧀🍭🧀🍭🧀🍭🧀🍭🤣🤣🤣🤣😂😀😀вот будет вот такой текст посмотрим как он отработае. костя молодец!', '2019-05-02 18:06:05'),
(30, 1, 'тест ', '2019-05-02 18:51:31'),
(31, 1, 'тест ', '2019-05-02 18:52:46'),
(32, 1, 'тест ', '2019-05-02 18:52:55'),
(33, 1, 'привет! ', '2019-05-02 18:54:59'),
(34, 1, ' ест ', '2019-05-02 18:56:51'),
(35, 2, 'Всем привет, ребята! Как у вас дела?', '2019-05-02 19:05:58'),
(36, 1, 'все отлично! 👍 ', '2019-05-02 19:06:12'),
(37, 1, 'привет', '2019-05-02 19:23:29'),
(38, 1, 'тест ', '2019-05-02 19:24:18'),
(39, 3, 'kukusiki', '2019-05-02 19:33:57'),
(40, 3, 'hello world!', '2019-05-02 19:34:57'),
(41, 3, 'чат работает!', '2019-05-02 19:35:11'),
(42, 1, 'урааааа! 👌🏿👌🏿👌🏿👌🏿👌🏿👋😂😂🍭🍭😂', '2019-05-02 19:35:22'),
(43, 1, 'кайф! ', '2019-05-02 19:35:31'),
(44, 3, 'не то слово)', '2019-05-02 19:35:41'),
(45, 1, ':) ', '2019-05-02 19:35:56'),
(46, 3, 'ЖЖЖЖЖ', '2019-05-02 19:36:00'),
(47, 1, 'привет 👋 ', '2019-05-02 21:46:02'),
(48, 1, 'тест ', '2019-05-02 21:47:08'),
(49, 1, 'всем привет', '2019-05-02 21:50:41'),
(50, 1, '   ', '2019-05-02 21:50:44'),
(51, 1, '🔥', '2019-05-02 21:50:51'),
(52, 1, 'всем привет 👋 ', '2019-05-03 11:59:16'),
(53, 1, 'тест', '2019-05-03 13:46:58'),
(54, 1, 'тест', '2019-05-03 13:47:09');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `email` text CHARACTER SET utf8 NOT NULL,
  `password` text CHARACTER SET utf8 NOT NULL,
  `nickname` text CHARACTER SET utf8 NOT NULL,
  `token` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `nickname`, `token`) VALUES
(1, 'i@kostyakulakov.ru', '$2a$10$IvScqPK4JM.O3ONmr1t6m.cRa8RUDwyA8UXDu7YFOm0ebN5UNc9C.', 'Konstantin', '389de4e2d5e9e4f9692a77e7c5f8a7a1'),
(2, 'test@mail.ru', '$2a$10$IvScqPK4JM.O3ONmr1t6m.cRa8RUDwyA8UXDu7YFOm0ebN5UNc9C.', 'Senya', '7effabd12cc04489196f8f101e4af034'),
(3, 'nikita@mail.ru', '$2a$10$IvScqPK4JM.O3ONmr1t6m.cRa8RUDwyA8UXDu7YFOm0ebN5UNc9C.', 'Nikita', '1fd8089e47db0a6a248cb55ada607103');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `history`
--
ALTER TABLE `history`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `history`
--
ALTER TABLE `history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
